import pytest
from src.masks import get_mask_account, get_mask_card_number

@pytest.mark.parametrize("num_check, expected", [("73654108430135874305", "**4305"),
                                                 (73654108430135874305, "**4305"),
                                                 ("73654 10843 01358 74305", "**4305"),
                                                 (" 73654108430135874305", "**4305"),
                                                 ("73654108430135874305 ", "**4305"),
                                                 ("", "Неверный формат номера счета"),
                                                 ("736541084300135874305", "Неверный формат номера счета"),
                                                 ("7364108430135874305", "Неверный формат номера счета"),
                                                 (736541084300135874305, "Неверный формат номера счета"),
                                                 (7365410830135874305, "Неверный формат номера счета")
                                                 ])

def test_get_mask_account(num_check, expected):
    assert get_mask_account(num_check) == expected


@pytest.mark.parametrize("card_number, expected", [("7000792289606361", "7000 79** **** 6361"),
                                                 (7000792289606361, "7000 79** **** 6361"),
                                                 ("7000 7922 8960 6361", "7000 79** **** 6361"),
                                                 (" 7000 7922 8960 6361", "7000 79** **** 6361"),
                                                 ("7000 7922 8960 6361 ", "7000 79** **** 6361"),
                                                 ("", "Неверный формат номера карты"),
                                                 ("70007922896063610", "Неверный формат номера карты"),
                                                 ("700792289606361", "Неверный формат номера карты"),
                                                 (70007922896063610, "Неверный формат номера карты"),
                                                 (700792289606361, "Неверный формат номера карты")
                                                   ])

def test_get_mask_card_number(card_number, expected):
    assert get_mask_card_number(card_number) == expected
